jimmywong2003/nrf5-hrs-central-to-2-peripheral-with-bonding-freeRtos/ble_app_hrs_c/main.c
        if (((addr_cnt == 0) && (irk_cnt == 0)) ||
            (m_whitelist_disabled))
        {
                // Don't use whitelist.
                err_code = nrf_ble_scan_params_set(&m_scan, NULL);
                APP_ERROR_CHECK(err_code);
        }
}


/**@brief Function to start scanning.
 */
static void scan_start(void)
{
        ret_code_t err_code;

        if (nrf_fstorage_is_busy(NULL))
        {
                m_memory_access_in_progress = true;
                return;
        }

        NRF_LOG_INFO("Starting scan.");

        err_code = nrf_ble_scan_start(&m_scan);
        APP_ERROR_CHECK(err_code);

        err_code = bsp_indication_set(BSP_INDICATE_SCANNING);
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
        ret_code_t err_code;
        bsp_event_t startup_event;

        err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
        APP_ERROR_CHECK(err_code);

        err_code = bsp_btn_ble_init(NULL, &startup_event);
        APP_ERROR_CHECK(err_code);

        *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
        ret_code_t err_code = NRF_LOG_INIT(NULL);
        APP_ERROR_CHECK(err_code);

        NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing the power management module. */
static void power_management_init(void)
{
        ret_code_t err_code;
        err_code = nrf_pwr_mgmt_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief GATT module event handler.
 */
static void gatt_evt_handler(nrf_ble_gatt_t * p_gatt, nrf_ble_gatt_evt_t const * p_evt)
{
        switch (p_evt->evt_id)
        {
        case NRF_BLE_GATT_EVT_ATT_MTU_UPDATED:
        {
                NRF_LOG_INFO("GATT ATT MTU on connection 0x%x changed to %d.",
                             p_evt->conn_handle,
                             p_evt->params.att_mtu_effective);
        } break;

        case NRF_BLE_GATT_EVT_DATA_LENGTH_UPDATED:
        {
                NRF_LOG_INFO("Data length for connection 0x%x updated to %d.",
                             p_evt->conn_handle,
                             p_evt->params.data_length);
        } break;

        default:
                break;
        }
}


static void scan_evt_handler(scan_evt_t const * p_scan_evt)
{
        ret_code_t err_code;
        switch(p_scan_evt->scan_evt_id)
        {
        case NRF_BLE_SCAN_EVT_WHITELIST_REQUEST:
        {
                on_whitelist_req();
                m_whitelist_disabled = false;
        } break;

        case NRF_BLE_SCAN_EVT_CONNECTED:
        {
                ble_gap_evt_connected_t const * p_connected =
                        p_scan_evt->params.connected.p_connected;
                // Scan is automatically stopped by the connection.
                NRF_LOG_INFO("Connecting to target 0x%02x%02x%02x%02x%02x%02x",
                             p_connected->peer_addr.addr[0],
                             p_connected->peer_addr.addr[1],
                             p_connected->peer_addr.addr[2],
                             p_connected->peer_addr.addr[3],
                             p_connected->peer_addr.addr[4],
                             p_connected->peer_addr.addr[5]
                             );
        } break;

        case NRF_BLE_SCAN_EVT_CONNECTING_ERROR:
        {
                err_code = p_scan_evt->params.connecting_err.err_code;
                APP_ERROR_CHECK(err_code);
        } break;

        case NRF_BLE_SCAN_EVT_SCAN_TIMEOUT:
        {
                NRF_LOG_INFO("Scan timed out.");
                scan_start();
        } break;

        case NRF_BLE_SCAN_EVT_FILTER_MATCH:
                break;


        case NRF_BLE_SCAN_EVT_WHITELIST_ADV_REPORT:
                break;

        default:
                break;
        }
}


/**@brief Function for initializing the timer.
 */
static void timer_init(void)
{
        ret_code_t err_code = app_timer_init();
        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void)
{
        // ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
        // APP_ERROR_CHECK(err_code);

        ret_code_t err_code;

        err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
        APP_ERROR_CHECK(err_code);

//        err_code = nrf_ble_gatt_att_mtu_central_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
//        APP_ERROR_CHECK(err_code);
//
//        err_code = nrf_ble_gatt_data_length_set(&m_gatt, BLE_CONN_HANDLE_INVALID, NRF_SDH_BLE_GAP_DATA_LENGTH);
//        APP_ERROR_CHECK(err_code);
}


/**@brief Function for initialization scanning and setting filters.
 */
static void scan_init(void)
{
        ret_code_t err_code;
        nrf_ble_scan_init_t init_scan;

        memset(&init_scan, 0, sizeof(init_scan));

        init_scan.p_scan_param     = &m_scan_param;
        init_scan.connect_if_match = true;
        init_scan.conn_cfg_tag     = APP_BLE_CONN_CFG_TAG;

        err_code = nrf_ble_scan_init(&m_scan, &init_scan, scan_evt_handler);
        APP_ERROR_CHECK(err_code);

        // Setting filters for scanning.
        err_code = nrf_ble_scan_filters_enable(&m_scan, NRF_BLE_SCAN_NAME_FILTER, false);
        APP_ERROR_CHECK(err_code);

        err_code = nrf_ble_scan_filter_set(&m_scan, SCAN_NAME_FILTER, m_target_periph_name);
        APP_ERROR_CHECK(err_code);

        // ble_uuid_t uuid =
        // {
        //         .uuid = TARGET_UUID,
        //         .type = BLE_UUID_TYPE_BLE,
        // };
        //
        // err_code = nrf_ble_scan_filter_set(&m_scan,
        //                                    SCAN_UUID_FILTER,
        //                                    &uuid);
        // APP_ERROR_CHECK(err_code);
        //
        // if (strlen(m_target_periph_name) != 0)
        // {
        //         err_code = nrf_ble_scan_filter_set(&m_scan,
        //                                            SCAN_NAME_FILTER,
        //                                            m_target_periph_name);
        //         APP_ERROR_CHECK(err_code);
        // }
        //
        // if (is_connect_per_addr)
        // {
        //         err_code = nrf_ble_scan_filter_set(&m_scan,
        //                                            SCAN_ADDR_FILTER,
        //                                            m_target_periph_addr.addr);
        //         APP_ERROR_CHECK(err_code);
        // }
        //
        // err_code = nrf_ble_scan_filters_enable(&m_scan,
        //                                        NRF_BLE_SCAN_ALL_FILTER,
        //                                        false);
        // APP_ERROR_CHECK(err_code);

